Revit 2024 API
RebarBendData Constructor
Overload List
Name | Description
RebarBendData()
 Constructs a new RebarBendData with default settings.
RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation)
 Constructs a new RebarBendData using the bar type, hook types, style and orientation values.
See Also
RebarBendData Class
RebarBendData Members
Autodesk.Revit.DB.Structure Namespace